label chapter0:
    #Фон: Кулисы.
    scene scene1 with Dissolve(3)
    show fan with Dissolve(1)
    play music waitingFans
    m "Короче, после концерта я совершенно свободен."
    fan "Тогда я буду ждать тебя у выхода!"
    m "Договорились."
    fan "Я хотела попросить тебя ещё кое о чём…"
    fan "Дай, пожалуйста, свой автограф!"
    "Я улыбнулся девушке и сделал несколько росчерков на протянутом листе. Она радостно ахнула."
    "На бумаге красовался мой автограф - небрежные завитки и нескромно раскинувшиеся линии, складывающиеся в имя “Максим”."
    "Кто-то выкрикнул моё имя. "
    q "Максим! Хорош уже девчонок клеить! Двухминутная готовность."
    "Это был наш вокалист, Паша."
    m "Эй, да брось! Я просто общаюсь с фанатами."
    "Впрочем, он был прав. Сквозь гул в зале было слышно, как кто-то - то там, то здесь - выкрикивает наши имена."
    "Сцена была готова - микрофоны выставлены, инструменты тоже на своих местах, как и группа. Только меня не хватало."
    "Я опрокинул в себя остатки пива в пластиковом стаканчике, бросил его куда-то не глядя и поднялся по ступенькам."
    #Фон: Рок-сцена.
    scene scene2 with Dissolve(2)
    stop music
    play music rockConcert
    "Стоило мне взяться за бас-гитару, как вспыхнули софиты. Из-за яркого света я не мог видеть толпу, но зато отлично слышал её рёв, нараставший с каждой песней."
    "В голове шумело то ли от выпитого, то ли попросту от того, что я был на сцене."
    "Сотни невидимых глаз устремили свой взгляд на нас, сотни невидимых глоток подбадривали нас криками и сотни голосов подпевали нашим песням."
    "Я шагнул вперёд."
    "Перед глазами всё слегка шаталось."
    fan1 "Максим!"
    fan1 "Максим, я хочу от тебя детей!"
    fan1 "Максим! Максим! Максим!"
    m "Вы хотите, чтобы я прыгнул?"
    fan1 "Да!!!"
    m "Тогда - ловите! Раз, два, три!"
    "Я приготовился к прыжку, рванулся вперёд…"
    #Фон: Рок-сцена с Максимом в воздухе.
    scene scene3
    "…как вдруг что-то оказалось под моей ногой."
    "Шнур."
    "Но мой прыжок было уже не остановить. Неловко взмахнув руками, я полетел через край сцены совсем не туда, куда хотел."
    stop music
    play sound fall
    #Арт: Максим лежит на полу.
    scene scene4
    "После этого я чувствовал только боль."
    play sound upsettingFans
    "Весёлые вопли мигом сменились испуганными возгласами."
    "Сам я с трудом мог шевелить губами."
    m "Вызовите скорую…"
    #Затемнение.

    #Сцена 2
    #Фон: Больничная палата.
    scene hospital1 with Dissolve(2)
    play music medicalMonitor
    "Открыв глаза, я не сразу понял, где нахожусь."
    "Обшарпанные стены, выкрашенные до середины в зелёный. Шесть кроватей, вместе с моей, и столько же тумб."
    "Через окно, не встречая преграды в виде штор или жалюзи, падал солнечный свет. Пахло лекарствами."
    "Больница."
    "Голова раскалывалась, не давая ни заснуть снова, ни встать и заняться делом."
    "Нога тоже болела - да уж, грохнулся я знатно. Наверное, перелом."
    "Я бессмысленно следил глазами за сеткой трещинок на краске, покрывавшей стены."
    "Тишину палаты нарушил звонок телефона. Я охнул: от громкого звука голова заболела сильнее."
    "Это была моя новенькая Nokia. Я думал было сбросить вызов, но увидел на экранчике имя нашего вокалиста. Значит, трубку всё-таки стоит поднять."
    pasha "Ты хоть знаешь, какой бардак вчера устроил?!"
    m "И тебе привет. Какой бардак?"
    pasha "Совсем мозги отшибло? Ты весь концерт запорол! Пришлось возвращать билеты и выплачивать неустойку!"
    m "И как это я всё запорол?"
    pasha "Как обычно. Освежу твою память: ты напился и решил сигануть в толпу."
    m "Это я помню. Только всё было бы хорошо, если бы шнур на сцене не оказался там. где его быть не должно."
    m "Ты же ответственен за… этот…"
    "Головная боль атаковала с новой силой."
    m "…кабель-менеджмент, вот. Так разве я виноват?"
    pasha "Если б ты не пил, то был бы аккуратнее."
    m "Ты просто не умеешь раскладывать шнуры."
    pasha "Вот как! Я не умею! Ну и раскладывал бы сам, вместо того, чтоб к девчонкам приставать!"
    pasha "Вот как два пальца об асфальт, ни одна ведь в итоге тебя не навестит."
    m "Ну и хрен с ними. В следующий раз к тебе буду приставать."
    pasha "Не будешь. И следующего раза не будет."
    "Во мне зародилось дурное предчувствие."
    pasha "Я не собачиться с тобой позвонил. Ты…"
    pasha "Ты больше не в группе."
    m "Чего?"
    m "Вы что, уже нашли мне замену?"
    pasha "Какая разница? Ты всё равно в другой город уезжаешь учиться. Всё равно не смог бы с нами играть."
    m "Ну и сволочи вы. Могли бы в лицо сказать, а не вот так, по телефону."
    pasha "Могли бы. Но тебе ж плевать на нас. Сколько раз просили: не пей перед концертом, помоги с подготовкой - тебе было всё равно."
    pasha "Только на девчонок и тратишь время."
    m "Фанатов надо уважать."
    pasha "А нас ты уважаешь?"
    "Я не знал, что ответить."
    pasha "Ага. То-то и оно."
    "Паша устало вздохнул."
    pasha "В общем, выздоравливай. Может, свидимся ещё."
    "Раздались гудки."
    "Я был так зол, что забыл о боли."
    "Ну и пошли они."
    "Нужны они мне. Сам группу соберу. И такой концерт устрою - они обзавидуются."
    "Я закрыл глаза."
    "Кого я обманываю? Один я не справлюсь, а где мне найти других?"
    "В палату зашла, цокая каблуками, медсестра."
    show nurse
    nurse "Лавров?"
    m "Есть такой."
    nurse "Ага, пришёл в себя. Нужно сдать анализы, так что я помогу вам дойти до процедурного кабинета."
    m "Благодарю, а то я тут ногу сломал - так некстати."
    "В глазах медсестры появилось сочувствие."
    nurse "Вы её не просто сломали."
    m "Как “не просто”? Что-то серьёзное?"
    "Я испуганно отдёрнул одеяло. Нога, к счастью, была на месте; впрочем, много радости мне это не добавило."
    "Медсестра: Доктор на обходе всё вам скажет."
    m "Скажите хоть что-нибудь!"
    nurse "Я не знаю в точности, но вам потребуется сложная операция. Без трости после выписки не обойдётесь."
    m "Боже мой, ну и попал я…"
    m "Не могли бы вы дать мне обезболивающее? Таблеточку там какую-нибудь."
    nurse "Таблеточку не могу дать, но я как раз должна сделать вам укол. Повернитесь."
    m "Это обезболивающее?"
    nurse "Это лекарство, которое вам необходимо получить."
    #Затемнение.
    scene d with Dissolve(1)
    m "Только вы сразу не колите, пожалуйста. Лучше на счёт три."
    nurse "Конечно-конечно."
    m "Раз…"
    m "Ай!"
    stop music

    #Сцена 3
    #Фон: Вагон.
    scene train with Dissolve(1)
    play music train
    m "Вот так я и решил, что пойду в программисты. Зарплаты хорошие, работа сидячая. В самый раз."
    "Стас, мой друг, одноклассник, а теперь, похоже, и одногруппник, покатывался со смеху на соседней полке."
    show stas
    "Я поёрзал, тщетно пытаясь найти удобное положение."
    m "Смешно тебе. А мне после всех этих уколов до сих пор сидеть не удобно."
    st "Ладно-ладно. История смешная, ситуация страшная."
    st "Только ты же музыкант. Если уж надо сидеть, сидел бы в оркестре каком-нибудь."
    m "Ага. Или в переходе, что вероятнее. Я же самоучка - консерватория мне не светит."
    st "Да, переход вероятнее. Ну, пока не научишься."
    m "Ты у нас тоже не первый программист в стране."
    st "Может, я и не очень опытен, но я хотя бы с PHP работал, да и JavaScript немного знаю."
    m "Ясно, пошёл я нахрен."
    st "Эй, я тебя бросать не собираюсь. Если понадобится совет - обращайся. Только знай, что за тебя я работу не сделаю, иначе обучение не даст плодов."
    m "Спасибо и на том. Как тебе идея заселиться вместе?"
    st "Попробуем, авось получится."
    "Мы помолчали."
    "Стас вытянулся на полке и вскоре уже похрапывал."
    "Я же смотрел в окно. За стеклом мелькали столбы и деревья, а за ними, в свою очередь, тянулась вдоль полей дорога."
    "Мы ещё не успели добраться до Уфы, но пейзаж успел уже несколько раз смениться до совсем непривычного."
    "Старые знакомые (язык не поворачивается назвать их друзьями) остались позади, за многие десятки и даже сотни километров."
    "Да что уж там, вся жизнь теперь где-то далеко. Прежняя жизнь, то есть."
    "А впереди…"
    "Новый город, новые люди, новые дела."
    "Не изменюсь ли и я сам в конце этой дороги? Каким я стану?"
    stop music



    #Сцена 4
    #Затемнение.
    scene d with Dissolve(1)
    "Вскоре поезд достиг города, где нам со Стасом предстояло жить ближайшие несколько лет."
    #Видеоролик.
    $ renpy.movie_cutscene("images/anim.ogv")
    #Фон: Общежитие снаружи.
    scene home1
    "Некоторое время спустя мы подъехали к общежитию."
    "Я расплатился с таксистом и повернулся к Стасу."
    m "Вроде это здесь. Ну что, дамы вперёд."
    #Фон: Коридор общежития.
    scene home2
    "В коридоре висел листок со списками заселяющихся. Кто-то из подходивших к нему радостно улыбался, кто-то - разочарованно пожимал плечами."
    #Арты: Список на заселение.
    scene home3
    "Мы со Стасом относились ко второму типу."
    m "Может, попробуем попросить, чтоб заселили вместе?"
    st "Попробуем."
    "Завидев меня со Стасом, комендантша строго зыркнула на нас из-под очков."
    "Какой-то парень позади неё, видно, хорошо знакомый с нравом комендантши, округлил глаза и провёл ладонью у горла."
    "Мы дружно развернулись."
    st "Не попробуем."
    "Делать нечего: мы разошлись по своим комнатам."
    "Дверь в мою была открыта, однако никого внутри не было."
    #Фон: Комната Максима и Айрата Рустемовича.
    scene home4
    $ o1 = 0
    $ o2 = 0
    $ o3 = 0
    $ o4 = 0
    $ o5 = 0
    jump osmotr1

label osmotr1:
    hide screen osmotr
    show screen osmotr
    "Ясно было только, что здесь точно кто-то живёт."
    #Изучение комнаты, как в Зайчике.
    #Les Paul  от Gibson: Это… Les Paul  от Gibson?! Шик!
    #Ламповый комбик: Ламповая. Это ламповая голова! Что тут за переключатели? Ревёрб, делау, волум...
    #Виниловый проигрыватель с пластинками: Похоже, мой сосед - любитель старины. Или сам - старина.
    #Кот на подоконнике: Разве в общагу можно приносить животных?..
    #Фотография: Ого, он тоже играл в группе? Но, судя по снимку,  с тех пор прошло много лет.
    if o1+o2+o3+o4+o5 == 5:
        hide screen osmotr
        jump chapter0_1
    jump osmotr1

label chapter0_1:
    show ar
    play sound cough
    "Пока я осматривался, кто-то подошёл к комнате и покашлял у двери. Я оглянулся."
    q "Прошу прощения, но что вы делаете в моей комнате?"
    m "Я… это… заселился."
    "Мой сосед по комнате был старше меня - аспирант, наверное. Ого!"
    "Он был высоким, худым мужчиной и обладал приятным, располагающим к себе лицом."
    "Одет он был просто, но опрятно: синяя водолазка и тёмные джинсы."
    q "Вот оно что… Я Айрат Рустемович."
    "Я протянул руку. Мой новый знакомый не стал её пожимать."
    m "Я Максим. Вы - аспирант?"
    ar "Да. Не думал, что ко мне кого-то подселят. Похоже, в этом году и впрямь много поступающих."
    ar "Ну что ж… не гнать же тебя на улицу. Особенно учитывая твою травму."
    "Он кивнул на мою ногу. Я стоял на ней нетвёрдо и больше опирался на трость - не знаю, сколько ещё придётся так проходить."
    ar "Как ты так повредился?"
    m "Да так… упал неудачно."
    "Я поспешил перевести тему."
    m "Тут столько дорогущих вещей… Как вы на всё это заработали?"
    "Айрат Рустемович легонько постучал по своей голове."
    ar "Мозгами, конечно. Учись хорошо - и без денег не останешься, поверь."
    "Да уж. Я ещё раз окинул взглядом комнату. Мой постер с Red Hot Chili Peppers на этом фоне выглядел в лучшем случае скромно."
    "Может быть, если б я меньше пил перед концертами, тоже бы так комнату обставил."
    ar "Я ведь не ошибся? Ты только поступил?"
    m "Да. Так что… всё впереди."
    "Айрат Рустемович как-то грустно усмехнулся, раскладывая принесённые книги на полке."
    ar "Это уж точно."
    m "А сколько вам?"
    ar "Двадцать семь."
    m "Вы только в “клуб 27” не попадите, ха-ха."
    ar "Прошу прощения?"
    m "Ну, как Курт Кобейн и Тупак Шакур."
    ar "Ах, понял."
    ar "Но, вообще-то, Тупак Шакур погиб в возрасте двадцати пяти лет, так что он не может быть причисленным к “клубу 27”."
    m "О…"
    "Я как-то подзабыл об этом."
    ar "Да и к тому же, вся эта история - во многом своего рода когнитивное искажение."
    ar "Если взглянуть на смерти всех музыкантов в целом…"
    ar "…то окажется, что в двадцать семь умирают не чаще, чем в любом другом возрасте."
    ar "Просто Хендриксу, Моррисону и Джоплин не посчастливилось быть знаменитыми в музыке и умереть в одно время."
    ar "Кстати, стыдно не упомянуть их в первую очередь."
    "Айрат Рустемович строго на меня посмотрел."
    ar "В общем, людям нравится делать из совпадений нечто большее."
    ar "Но, если хочешь заниматься наукой, проверяй все факты."
    ar "Кстати… Я нечасто общаюсь с первокурсниками, но если выдаётся случай, я всем задаю один вопрос."
    ar "Ради чего ты поступил в университет?"
    menu:
        "Учёба":
            m "Хочу учиться."
            ar "Хм? Похвальное желание. Всецело одобряю."
        "Деньги":
            m "Хочу хорошо зарабатывать."
            ar "Что ж, по крайней мере, ты хочешь зарабатывать мозгами, а не кулаками."
        "Любовь":
            m "Хочу встретить девушку, с которой буду всегда."
            ar "Как романтично. Что ж, удачи в этом нелёгком деле - среди программистов-то."
        "Связи":
            m "Хочу завести полезные знакомства."
            ar "Видел я тут одного первокурсника… Думаю, вы с ним подружитесь."
        "Музыка":
            m "Хочу заняться музыкой."
            ar "Это объясняет, почему у тебя гитара за спиной. Но смотри, про учёбу не забывай, раз уж поступил сюда."
        "Не знаю":
            m "Не знаю."
            ar "Не знаешь? Надо бы решить поскорее."
    ar "Ну, чего бы ты ни хотел, я надеюсь на одно: ты не станешь отвлекать меня от написания кандидатской."
    "Я кивнул."
    "Остаток вечера я решил посвятить разбору сумок. Я разложил все вещи, что привёз с собой, повесил над кроватью постер и облегчённо вздохнул."
    "Айрат Рустемович тем временем сидел над учебниками и что-то сосредоточенно выписывал."
    "Глаза слипались. Я зевнул и лёг спать."
    #Затемнение.
    scene d with Dissolve(1)
